# QTM 385

> Data Science with Pandas 2

# Data Science with Pandas

Now we start our Data Science in Python part of the course. As you know the programming language structure, you will see that it is much easier to get things done using custom packages.

## Load Pandas and Numpy

To get started, let us load Pandas and Numpy:

In [1]:
# My code here
import pandas as pd
import numpy as np

## Load Datasets

We will load three datasets here:

In [2]:
# My code here 

#Loading RAW data from github
perisk = pd.read_csv('https://raw.githubusercontent.com/umbertomig/qtm151/main/datasets/PErisk.csv') 
tips = pd.read_csv('https://raw.githubusercontent.com/umbertomig/qtm151/main/datasets/tips.csv')

**Exercise**: Explore the datasets we just loaded.

In [11]:
## Your answers here!
perisk.head()

      country  courts     barb2  prsexp2  prscorr2      gdpw2
0   Argentina       0 -0.720775        1         3   9.690170
1   Australia       1 -6.907755        5         4  10.304840
2     Austria       1 -4.910337        5         4  10.100940
3  Bangladesh       0  0.775975        1         0   8.379768
4     Belgium       1 -4.617344        5         4  10.250120

In [12]:
tips.head()

   obs  totbill   tip sex smoker  day   time  size
0    1    16.99  1.01   F     No  Sun  Night     2
1    2    10.34  1.66   M     No  Sun  Night     3
2    3    21.01  3.50   M     No  Sun  Night     3
3    4    23.68  3.31   M     No  Sun  Night     2
4    5    24.59  3.61   F     No  Sun  Night     4

In [13]:
perisk.describe()

          courts      barb2    prsexp2   prscorr2      gdpw2
count  62.000000  62.000000  62.000000  62.000000  62.000000
mean    0.451613  -2.925557   3.274194   2.532258   9.041875
std     0.501716   2.707211   1.369089   1.501013   0.970264
min     0.000000  -6.907755   0.000000   0.000000   7.029973
25%     0.000000  -4.894882   3.000000   1.250000   8.381027
50%     0.000000  -2.353233   3.000000   2.000000   9.185412
75%     1.000000  -1.301007   4.000000   4.000000   9.889280
max     1.000000   2.337425   5.000000   5.000000  10.410180

In [14]:
tips.describe()

              obs     totbill         tip        size
count  244.000000  244.000000  244.000000  244.000000
mean   122.500000   19.785943    2.998279    2.569672
std     70.580923    8.902412    1.383638    0.951100
min      1.000000    3.070000    1.000000    1.000000
25%     61.750000   13.347500    2.000000    2.000000
50%    122.500000   17.795000    2.900000    2.000000
75%    183.250000   24.127500    3.562500    3.000000
max    244.000000   50.810000   10.000000    6.000000

## Counting

### Counting data

To count data we need to:

```
dat["variable"].value_counts()
```

If we want it sorted, we can type:

```
dat["variable"].value_counts(sort = True)
```

We can also count proportions:

```
dat["variable"].value_counts(normalize = True)
```

Let's try?!

In [21]:
# My code here
perisk.head()

      country  courts     barb2  prsexp2  prscorr2      gdpw2
0   Argentina       0 -0.720775        1         3   9.690170
1   Australia       1 -6.907755        5         4  10.304840
2     Austria       1 -4.910337        5         4  10.100940
3  Bangladesh       0  0.775975        1         0   8.379768
4     Belgium       1 -4.617344        5         4  10.250120

In [24]:
perisk['courts'].value_counts()

0    34
1    28
Name: courts, dtype: int64

In [27]:
# Say that we want proportions
perisk['courts'].value_counts(normalize=True)

0    0.548387
1    0.451613
Name: courts, dtype: float64

In [31]:
# Sort descending by value count
print(perisk['prsexp2'].value_counts(sort=True))

#Sort ascending by value
perisk['prsexp2'].value_counts(sort=False)

3    19
5    14
4    14
2     7
1     6
0     2
Name: prsexp2, dtype: int64

0     2
1     6
2     7
3    19
4    14
5    14
Name: prsexp2, dtype: int64

In [32]:
perisk['prsexp2'].value_counts(sort=False, normalize=True)

0    0.032258
1    0.096774
2    0.112903
3    0.306452
4    0.225806
5    0.225806
Name: prsexp2, dtype: float64

### Detecting missing data

We can also detect missing data using the function:

```
dat.isna()
```

And if we want, count the missing data by variable:

```
dat.isna().sum()
```

Ultimately, to remove the missing we should:

```
dat.dropna()
```

Or we can fill the missing with a custom value (proceed with caution here!)

* This may alter the averages of the data! I guess do this if you feel confident but otherwise dont!
```
dat.fillna(0)
```

In [41]:
# Load gss data
gss = pd.read_csv('https://raw.githubusercontent.com/umbertomig/qtm151/main/datasets/gss.csv')

In [42]:
gss.describe() # We can see that age and year have different number of entries

                age          year
count  53285.000000  53474.000000
mean      45.631285   1991.954894
std       17.472393     10.948351
min       18.000000   1973.000000
25%       31.000000   1983.000000
50%       43.000000   1993.000000
75%       59.000000   2002.000000
max       99.000000   2010.000000

In [45]:
#gss.isna() -- Check if cell is missing a value 
gss.isna().sum() # Sums the number of missing values for each column

region          0
income       2354
happy        4721
age           189
finrela      4894
marital        20
degree        142
health      13201
wrkstat        13
partyid       307
polviews     7411
sex             0
year            0
dtype: int64

In [46]:
gss['health'].value_counts()

GOOD         17747
EXCELLENT    12135
FAIR          7402
POOR          2224
IAP            763
DK               2
Name: health, dtype: int64

In [47]:
# Getting rid of all of those NA values
gss2 = gss.dropna()

In [49]:
# Now let's see how many entries we have!
gss2.describe() ## Use with caution!

                age          year
count  32270.000000  32270.000000
mean      45.288596   1991.575798
std       17.199179     10.877121
min       18.000000   1974.000000
25%       31.000000   1982.000000
50%       43.000000   1993.000000
75%       58.000000   2000.000000
max       99.000000   2010.000000

In [50]:
# Say we filled the NAs with "0", it alters the mean!
gss3 = gss.fillna(0)
gss3.describe() # Now the min age is 0... doesn't seem right.

                age          year
count  53474.000000  53474.000000
mean      45.470004   1991.954894
std       17.650469     10.948351
min        0.000000   1973.000000
25%       31.000000   1983.000000
50%       43.000000   1993.000000
75%       58.000000   2002.000000
max       99.000000   2010.000000

**Exercise**: Count the number of `tips` by week day. Then, normalize to have the proportions.

In [40]:
## Your answers here!
tips['day'].value_counts(normalize=True)

Sat    0.356557
Sun    0.311475
Thu    0.254098
Fri    0.077869
Name: day, dtype: float64

## Summary by groups

Suppose we want the mean of gdp by countries with and without courts. There are two ways:

```
# Hard way
perisk[perisk['courts'] == 0]['gdpw2'].mean()
perisk[perisk['courts'] == 1]['gdpw2'].mean()
```

Or, we can use the `groupby` function in Pandas:

```
# Easy way
perisk.groupby("courts")["gdpw2"].mean()
```

In [52]:
# For countries with no courts
perisk[perisk['courts'] == 0]['gdpw2'].mean()

8.506674117647057

In [53]:
# For countries with courts
perisk[perisk['courts'] == 1]['gdpw2'].mean()

9.691761285714287

In [55]:
# Since the gdp is reported in log scale, we need to convert to raw count:

# GDP is vastly more different now!
np.exp(8.506674117647057), np.exp(9.691761285714287)

(4947.680291027636, 16183.723367095039)

In [62]:
perisk.groupby('courts')['gdpw2'].mean()

courts
0    8.506674
1    9.691761
Name: gdpw2, dtype: float64

In [61]:
perisk.groupby('prsexp2')['gdpw2'].mean()

prsexp2
0     8.975828
1     8.483506
2     8.695454
3     8.613695
4     8.947314
5    10.139483
Name: gdpw2, dtype: float64

**Exercise**: In the `tips` dataset, compute the mean of tips by weekday.

In [67]:
## Your answers here!
tips.groupby('day')['tip'].sum()

day
Fri     51.96
Sat    260.40
Sun    247.39
Thu    171.83
Name: tip, dtype: float64

### Summary by groups (multiple functions)

To group results by multiple functions, we can simply:

```
dat.groupby("var_group")["var_stat"].agg([stat1, stat2, stat3])
```

### Summary by groups (multiple levels)

To group results by multiple levels, we can simply:

```
dat.groupby(["varlevel1", "varlevel2"])["var_stat"].mean()
```

In [72]:
# My code here
perisk.groupby("courts")["gdpw2"].agg([min, max, sum])

             min       max         sum
courts
0       7.029973  10.06777  289.226920
1       8.126518  10.41018  271.369316

In [71]:
# Say you want to sort by multiple groups within the dataset:
perisk.groupby(["courts", 'prsexp2'])["gdpw2"].agg([min, max, sum])

                     min        max         sum
courts prsexp2
0      0        8.583543   9.368114   17.951657
       1        7.095064   9.690170   50.901037
       2        7.597396   9.661735   60.868175
       3        7.029973   9.701494  117.212648
       4        7.331715  10.067770   42.293403
1      3        9.052400   9.848820   46.447559
       4        8.126518  10.260780   82.968996
       5        9.882724  10.410180  141.952761

**Exercise**: For the `tips` dataset:

1. Compute maximum, minimum, and sum of tips by weekday
2. Compute the sum of tips by weekday and day time.

In [74]:
## Your answers here!
tips.groupby("day")["tip"].agg([min, max, sum])

      min    max     sum
day
Fri  1.00   4.73   51.96
Sat  1.00  10.00  260.40
Sun  1.01   6.50  247.39
Thu  1.25   6.70  171.83

In [75]:
tips.groupby(["day", "time"])["tip"].agg([min, max, sum])

            min    max     sum
day time
Fri Day    1.58   3.48   16.68
    Night  1.00   4.73   35.28
Sat Night  1.00  10.00  260.40
Sun Night  1.01   6.50  247.39
Thu Day    1.25   6.70  168.83
    Night  3.00   3.00    3.00

## Indexing

To find the indexes we use:

```
dat.columns
dat.index
```

We can set index:

```
dat_ind = dat.set_index("var_index")
```

And to remove indexing:

```
dat_ind.reset_index()
```

The reason we index is because it makes subset simple:

```
# Hard way:
perisk[perisk["country"].isin(["Argentina", "Austria"])]

# Easy way:
perisk_ind.loc[["Argentina", "Austria"]]
```

Also, indexes do not need to be unique, and you can use multiple levels to index.

In [86]:
# My code here
print(perisk.columns)
print(perisk.index) # -- Gives us the name of the rows, or how the rows are being indexed
# There are 63 rows!

Index(['country', 'courts', 'barb2', 'prsexp2', 'prscorr2', 'gdpw2'], dtype='object')
RangeIndex(start=0, stop=62, step=1)

In [87]:
perisk.head()

      country  courts     barb2  prsexp2  prscorr2      gdpw2
0   Argentina       0 -0.720775        1         3   9.690170
1   Australia       1 -6.907755        5         4  10.304840
2     Austria       1 -4.910337        5         4  10.100940
3  Bangladesh       0  0.775975        1         0   8.379768
4     Belgium       1 -4.617344        5         4  10.250120

In [89]:
# Changing the index
perisk2 = perisk.set_index('country')

In [92]:
# Now the index is the country names!
print(perisk2.index)

# ALso changes the display of the data
perisk2.head()

Index(['Argentina', 'Australia', 'Austria', 'Bangladesh', 'Belgium', 'Bolivia',
       'Botswana', 'Brazil', 'Burma', 'Cameroon', 'Canada', 'Chile',
       'Colombia', 'Congo-Kinshasa', 'Costa Rica', 'Cote d'Ivoire', 'Denmark',
       'Dominican Republic', 'Ecuador', 'Finland', 'Gambia, The', 'Ghana',
       'Greece', 'Hungary', 'India', 'Indonesia', 'Iran', 'Ireland', 'Israel',
       'Italy', 'Japan', 'Kenya', 'Korea, South', 'Malawi', 'Malaysia',
       'Mexico', 'Morocco', 'New Zealand', 'Nigeria', 'Norway',
       'Papua New Guinea', 'Paraguay', 'Philippines', 'Poland', 'Portugal',
       'Sierra Leone', 'Singapore', 'South Africa', 'Spain', 'Sri Lanka',
       'Sweden', 'Switzerland', 'Syria', 'Thailand', 'Togo', 'Tunisia',
       'Turkey', 'United Kingdom', 'Uruguay', 'Venezuela', 'Zambia',
       'Zimbabwe'],
      dtype='object', name='country')

            courts     barb2  prsexp2  prscorr2      gdpw2
country
Argentina        0 -0.720775        1         3   9.690170
Australia        1 -6.907755        5         4  10.304840
Austria          1 -4.910337        5         4  10.100940
Bangladesh       0  0.775975        1         0   8.379768
Belgium          1 -4.617344        5         4  10.250120

In [101]:
# Locating Argentina and Austria is easy now that it is indexed by country
perisk2.loc[['Argentina', 'Austria', 'Belgium']]
# perisk2.loc[['Argentina', 'Austria', 'belgium']] -- Python is CASE SENSITIVE!!! Careful

           courts     barb2  prsexp2  prscorr2     gdpw2
country
Argentina       0 -0.720775        1         3   9.69017
Austria         1 -4.910337        5         4  10.10094
Belgium         1 -4.617344        5         4  10.25012

In [100]:
# Revert to original index
perisk2.reset_index().head()

      country  courts     barb2  prsexp2  prscorr2      gdpw2
0   Argentina       0 -0.720775        1         3   9.690170
1   Australia       1 -6.907755        5         4  10.304840
2     Austria       1 -4.910337        5         4  10.100940
3  Bangladesh       0  0.775975        1         0   8.379768
4     Belgium       1 -4.617344        5         4  10.250120

**Exercise**: Index the data by the variable `obs`. Subset the observations 33 and 132.

In [103]:
## Your answers here!
tips2 = tips.set_index('obs')

In [109]:
tips2.loc[[33,132]]

     totbill   tip sex smoker  day   time  size
obs
33     15.06  3.00   F     No  Sat  Night     2
132    20.27  2.83   F     No  Thu    Day     2

## Plots

Now, let's create some plots!

The library to create plots is the `matplotlib`. We can import this library easily in python:

```
from matplotlib import pyplot as plt
```

### Scatterplot

And for making a plot we need to:

```
plt.plot(dat.vx, dat.vy, kind="scatter")
plt.show()
```

If we want to add legends and change attributes:

```
plt.plot(dat.vx, dat.vy, kind="scatter")
plt.xlabel("X-axis name")
plt.ylabel("Y-axis name")
plt.title("Plot title")
plt.show()
```

In [12]:
# My code here

### Histogram

We can make a simple histogram using the function `.hist()`:

```
dat['variable'].hist()
plt.show()
```

And if we want overlapping histograms by a category:

```
dat[dat['vcat'] == 'v1']['variable'].hist()
dat[dat['vcat'] == 'v2']['variable'].hist()
plt.legend(["v1", "v2"])
plt.show()
```

Let's try?

In [13]:
# My code here

**Exercise**:

In [14]:
## Your answers here!

**Great job!!!**